cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'TylerBrock/saw'
tap 'amar1729/formulae'
tap 'dart-lang/dart'
tap 'goreleaser/tap/goreleaser'
tap 'warrensbox/tap/tfswitch'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags-exuberant'
brew 'gist'
brew 'git'
brew 'git-flow-avh'
brew 'htop'
brew 'jq'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'terminal-notifier'
brew 'postgresql@9.5'
brew 'terraform'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'watch'
brew 'awscli'
brew 'bash'
brew 'saw'
brew 'go'
brew 'python'
brew 'dart'
brew 'pandoc'
brew 'goreleaser'
brew 'asciinema'

# Dependencies for gopass password manager on macos
brew 'gnupg'
brew 'pinentry-mac'
brew 'gopass'
brew 'coreutils'
brew 'gnu-sed'
brew 'browserpass'
brew 'k6'

cask 'atom'
cask 'caffeine'
cask 'flux'
cask 'gitter'
cask 'iterm2'
cask 'kap'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'ngrok'
cask 'visual-studio-code'
cask 'typora'
cask 'docker'

