cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/bundle'
tap 'TylerBrock/saw'
tap 'amar1729/formulae'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags-exuberant'
brew 'gist'
brew 'git'
brew 'git-flow-avh'
brew 'htop'
brew 'jq'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'terminal-notifier'
brew 'postgresql'
brew 'terraform'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'watch'
brew 'awscli'
brew 'bash'
brew 'saw'
brew 'go'
brew 'python'
brew 'goreleaser/tap/goreleaser'
# brew 'warrensbox/tap/tfswitch' // can reinstall this when https://github.com/warrensbox/terraform-switcher/issues/152 is resolved - manually applied fix with https://github.com/chrispruitt/terraform-switcher for now
brew 'asciinema'
brew 'saml2aws'
brew 'openvpn'
brew 'expect'
brew 'speedtest-cli'

# Dependencies for gopass password manager on macos
brew 'gnupg'
brew 'pinentry-mac'
brew 'gopass'
brew 'coreutils'
brew 'gnu-sed'
brew 'browserpass'
brew 'k6'

cask 'gitter'
cask 'iterm2'
cask 'kap'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'ngrok'
cask 'typora'
cask 'slack'
