cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/versions'
tap 'TylerBrock/saw'

brew 'ack'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags-exuberant'
brew 'gist'
brew 'git'
brew 'git-flow-avh'
brew 'htop'
brew 'jq'
brew 'macvim', args: ['HEAD', 'with-lua', 'with-luajit', 'with-override-system-vim']
brew 'mysql'
brew 'nmap'
brew 'node'
brew 'openssl'
brew 'redis'
brew 'terminal-notifier'
brew 'https://raw.githubusercontent.com/Homebrew/homebrew-core/f2a764ef944b1080be64bd88dca9a1d80130c558/Formula/python.rb', args: ['ignore-dependencies']
brew 'postgresql@9.5'
brew 'terraform'
brew 'wget'
brew 'yarn'
brew 'zsh'
brew 'watch'
brew 'awscli'
brew 'bash'
brew 'saw'
brew 'go'
brew 'terraform_landscape'

cask 'atom'
cask 'caffeine'
cask 'flux'
cask 'gitter'
cask 'iterm2'
cask 'jing'
cask 'kap'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'ngrok'

